using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace prac11
{
    class Program
    {
        static void Main(string[] args)
        {
            //Задача 6. Подсчет количества вхождений определенного числа в массив.
            //int[] omas = { 1, 2, 3, 4, 5, 2, 2, 6, 7, 2 };
            //Console.Write("Введите число для подсчета: ");
            //int i = int.Parse(Console.ReadLine());
            //int count = Array.FindAll(omas, x => x == i).Length;
            //Console.WriteLine($"Число {i} встречается {count} раза в массиве.");
            //Console.ReadLine();
        }
    }
}
